In [236]:
import pandas as pd

In [237]:
df = pd.read_csv("netflix_titles.csv",sep=',')

In [238]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       7787 non-null   object
 1   type          7787 non-null   object
 2   title         7787 non-null   object
 3   director      5398 non-null   object
 4   cast          7069 non-null   object
 5   country       7280 non-null   object
 6   date_added    7777 non-null   object
 7   release_year  7787 non-null   int64
 8   rating        7780 non-null   object
 9   duration      7787 non-null   object
 10  listed_in     7787 non-null   object
 11  description   7787 non-null   object
dtypes: int64(1), object(11)
memory usage: 730.2+ KB

In [239]:
df['country'].isna().sum()

507

In [240]:
df.loc[df['country'].isna(),'country']='No Country'

In [241]:
# Potencial solucion para ejercicio 2
#df['country'].str.split(',')

In [242]:
#Ejercicio 2
df['country']=df['country'].apply(lambda x: x.split(', '))
df_explode=df.explode('country')

In [243]:
#Ejercicio 3
df_explode['country'].value_counts().head(5)

country
United States     3296
India              990
United Kingdom     722
No Country         507
Canada             412
Name: count, dtype: int64

In [244]:
#Ejercicio 4
df_explode['date_added']=df_explode['date_added'].str.strip()
df_explode['date_added']=pd.to_datetime(df_explode['date_added'],format="%B %d, %Y")
df_grouped=df_explode.groupby('country',as_index=False).agg({'date_added':[min,max]})
df_grouped.head(10)

/tmp/ipykernel_24030/1204924041.py:4: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'min' instead.
  df_grouped=df_explode.groupby('country',as_index=False).agg({'date_added':[min,max]})
/tmp/ipykernel_24030/1204924041.py:4: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'max' instead.
  df_grouped=df_explode.groupby('country',as_index=False).agg({'date_added':[min,max]})

       country date_added
                      min        max
0  Afghanistan 2017-01-01 2017-01-01
1      Albania 2018-05-04 2018-05-04
2      Algeria 2020-06-18 2020-12-26
3       Angola 2020-08-28 2020-08-28
4    Argentina 2016-07-15 2020-11-24
5      Armenia 2017-08-15 2017-08-15
6    Australia 2015-02-15 2021-01-01
7      Austria 2016-11-04 2020-11-11
8   Azerbaijan 2016-12-26 2016-12-26
9      Bahamas 2020-08-31 2020-08-31

In [249]:
# Ejercicio 5
df_grouped_ejercicio5=df_explode.groupby(['country','rating']).agg({'title':'count'}).sort_values(by='title',ascending=False)
df_grouped_ejercicio5

                      title
country       rating
United States TV-MA    1033
India         TV-14     542
United States R         539
              TV-14     464
              PG-13     340
...                     ...
Venezuela     NR          1
Argentina     TV-G        1
Armenia       TV-MA       1
Austria       R           1
Azerbaijan    TV-14       1

[510 rows x 1 columns]

In [260]:
df_grouped_ejercicio5.reset_index().groupby(['country','rating']).idxmax()

                     title
country      rating
Afghanistan  TV-MA     498
Albania      TV-MA     503
Algeria      TV-MA     264
Angola       TV-MA     493
Argentina    G         492
...                    ...
West Germany TV-14     497
             TV-MA     228
Zimbabwe     NR        499
             TV-G      500
             TV-MA     501

[510 rows x 1 columns]

In [247]:
df_grouped_ejercicio5.loc[]

SyntaxError: invalid syntax (110423317.py, line 1)